#include<stdio.h>
int main()
{
    int x;
    int i;
    //创建一个元素是10的数组，每个元素的值
    //是0
    int count[10];//此处定义一个元素个数为10的数组，也就是说数字的值只能有9种
    for ( i = 0; i <10; i++)
    {
    count[i]=0;
    }
    scanf("%d",&x);
   //读取输入的数字并写入到相应的元素
    while(x!=-1){   //  不要忘了在输入的时候最后以-1结束
    if (x>=0&&x<=9)// 由于我们的数组元素只有十个，所以我们的值只能有9种，如果此处
    {              //不加限制，有可能我们的数字会读到11  12  这样比9大的数字，这样会     
        count[x]++;//超出数组的范围，导致编译报错
    }
    scanf("%d",&x);// 不要忘了读取下一个
    }
    //打印每个数字出现的次数，由于每个数字写入到了
    //到了数组的相应位置，所与以我们读取每个元素的
    //的大小就读取到了每个数字的次数
    for ( i = 0; i < 10; i++)
    {
    printf("%d:%d\n",i,count[i]);
    }
    return 0;
}
